Repository: CofficLab/GitOK
Catalog: Packages/PluginGitConflictResolver/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: %lld conflicted file(s)
zh_hans: %lld 个冲突文件
zh_hk: %lld 個衝突檔案

source: Abort Merge
zh_hans: 终止合并
zh_hk: 終止合併

source: Both
zh_hans: 双方
zh_hk: 雙方

source: Checking conflicts…
zh_hans: 正在检查冲突…
zh_hk: 正在檢查衝突…

source: Choose
zh_hans: 选择
zh_hk: 選擇

source: Confirm Abort Merge?
zh_hans: 确认终止合并？
zh_hk: 確認終止合併？

source: Conflict Resolution
zh_hans: 冲突处理
zh_hk: 衝突處理

source: Conflict Resolver
zh_hans: 冲突解决
zh_hk: 衝突解決

source: Conflicted files are detected across the repository.
zh_hans: 检测整个仓库中的冲突文件。
zh_hk: 檢測整個倉庫中的衝突文件。

source: Conflicts %lld
zh_hans: 冲突 %lld
zh_hk: 衝突 %lld

source: Conflicts resolved with clarity, not guesswork.
zh_hans: 解决冲突靠清晰，而非猜测。
zh_hk: 解決衝突靠清晰，而非猜測。

source: Continue Merge
zh_hans: 继续合并
zh_hk: 繼續合併

source: Copy Path
zh_hans: 复制路径
zh_hk: 複製路徑

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Detect
zh_hans: 检测
zh_hk: 檢測

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Keep Ours
zh_hans: 保留我方
zh_hk: 保留我方

source: Keep Theirs
zh_hans: 保留对方
zh_hk: 保留對方

source: Merge Manually
zh_hans: 手动合并
zh_hk: 手動合併

source: Merge OK
zh_hans: 合并正常
zh_hk: 合併正常

source: No conflicted files
zh_hans: 没有冲突文件
zh_hk: 沒有衝突檔案

source: No merge conflicts
zh_hans: 没有合并冲突
zh_hk: 沒有合併衝突

source: Open the conflicted file and craft the final content.
zh_hans: 打开冲突文件，手工整理最终内容。
zh_hk: 打開衝突文件，手工整理最終內容。

source: Ours
zh_hans: 我方
zh_hk: 我方

source: Pick ours, theirs, or edit by hand.
zh_hans: 选择我方、对方或手工编辑。
zh_hk: 選擇我方、對方或手工編輯。

source: Resolve all conflicts before continuing the merge.
zh_hans: 请先解决所有冲突，再继续合并。
zh_hk: 請先解決所有衝突，再繼續合併。

source: Reveal in Finder
zh_hans: 在访达中显示
zh_hk: 在 Finder 中顯示

source: Stage the result
zh_hans: 暂存结果
zh_hk: 暫存結果

source: Take the current branch's version of the conflict.
zh_hans: 采用当前分支对冲突的版本。
zh_hk: 採用當前分支對沖突的版本。

source: Take the incoming branch's version.
zh_hans: 采用传入分支的版本。
zh_hk: 採用傳入分支的版本。

source: The resolution is staged and marked resolved.
zh_hans: 解决方案被暂存并标记为已解决。
zh_hk: 解決方案被暫存並標記為已解決。

source: Theirs
zh_hans: 对方
zh_hk: 對方

source: There are %lld conflicted files. Click to resolve them.
zh_hans: 有 %lld 个冲突文件，点击解决。
zh_hk: 有 %lld 個衝突檔案，點擊解決。

source: This discards the in-progress merge and restores the pre-merge state.
zh_hans: 这会放弃正在进行的合并并恢复合并前状态。
zh_hk: 這會放棄正在進行的合併並恢復合併前狀態。

source: Use Base
zh_hans: 使用基准
zh_hk: 使用基準

source: Use Ours
zh_hans: 使用我们的版本
zh_hk: 使用我們的版本

source: Use Theirs
zh_hans: 使用对方版本
zh_hk: 使用對方版本

source: View Conflict Diff
zh_hans: 查看冲突差异
zh_hk: 查看衝突差異

source: click to resolve
zh_hans: 一键解决
zh_hk: 一鍵解決

source: resolution choices
zh_hans: 解决选项
zh_hk: 解決選項

source: Abort Cherry-pick
zh_hans: 终止 Cherry-pick

source: Confirm Abort Cherry-pick?
zh_hans: 确认终止 Cherry-pick？

source: Continue Cherry-pick
zh_hans: 继续 Cherry-pick

source: Resolve all conflicts before continuing the cherry-pick.
zh_hans: 请先解决所有冲突，再继续 Cherry-pick。

source: This discards the in-progress cherry-pick and restores the pre-cherry-pick state.
zh_hans: 这会放弃正在进行的 Cherry-pick 并恢复操作前状态。
